{
  "welcome": {
    "title": "Welcome!",
    "text": "I'm a fullstack developer. Check out my profile and projects. I like cooking, drawing and being alchemist 游눹游꼢游꿛丘勇"
  },
  "tech": {
    "title": "Tecnolog칤as",
    "msg": "Pasa por encima de cada tecnolog칤a para ver su descripci칩n.",
    "html": {
      "name": "HTML 5",
      "version": "",
      "desc": "Lenguaje de marcado para la construcci칩n de p치gians web"
    },
    "css": {
      "name": "CSS 3",
      "version": "",
      "desc": "Permite maquetar y dar estilo a las p치ginas web"
    },
    "ES": {
      "name": "ECMA Script",
      "version": "",
      "desc": "El est치ndar ECMA Script es implementado por lenguajes como JavaScript. Permite crear web din침amicas y base para todo el universo de frameworks front.end"
    },
    "typescript": {
      "name": "Typescript",
      "version": "",
      "desc": "Es un transpilador de JavaScript. Mejora este incluyendo funciones de lengaujes de POO tipados."
    },
    "react": {
      "name": "ES 13",
      "version": "",
      "desc": "Librer칤a front-end de JavaScript para crear webs SPA. Lo considero el que mejro curva de aprendizaje tiene. Tambi칠n el m치s f치cil para escalar siendo su punto d칠bil, facilidad de crear espagueti code."
    },
    "redux": {
      "name": "Redux",
      "version": "",
      "desc": "Gestor de estados para React. Permite tener un almac칠n central, donde guardamos los datos que sean comunes a todos los componentes"
    },
    "vue": {
      "name": "Vue",
      "version": "2-3",
      "desc": "Librer칤a front para crear webs SPA. Parece un h칤brido entre React y Angular. La versi칩n 2 trabajas con la Options APi, mientra la 3 con la Composition API. Me gusta m침as la versi칩n 2, es m치s intuitiva e inmediata de usar."
    },
    "pineaple": {
      "name": "Pineaple",
      "version": "2-3",
      "desc": "Gestor de estados para Vue. Mucho m치s intuitivo y f치cil de usar que Redux"
    },
    "angular": {
      "name": "Angular",
      "version": "2-3",
      "desc": "Framework para crear SPA en JavaScript. A diferencia de React y Vue, es un framework compelto ahorrandote mucho trabajo. La curva de aprendizaje es alta, pero es genial su escalabilidad en aplicaciones de tama침o mediano-grande. Ideal para principiantes para aprender prender buens pr치cticas."
    },
    "node": {
      "name": "Node",
      "version": "2-3",
      "desc": "Lenguaje interpretado que usa JavaScript. Permite construir r치pidamente APIs, ideal para apps de tama침o peque침o-mediano"
    },
    "express": {
      "name": "Express",
      "version": "2-3",
      "desc": "Librer칤a para Node para crear backs. Puedes crear APIs o devolver p치gians est치ticas."
    },
    "mongoose": {
      "name": "Mongoose",
      "version": "2-3",
      "desc": "Librer칤a para construir un ODM de Mongo para Node"
    },
    "sequalize": {
      "name": "Sequalize",
      "version": "2-3",
      "desc": "Librer칤a para construir un ORM SQL para Node"
    },
    "apollo": {
      "name": "Apollo",
      "version": "2-3",
      "desc": "Librer칤a para front y back que eprmite trabajar con GraphQL, una nueva forma de crear APIs como si se tratase de lenguaje SQL"
    },
    "webpack": {
      "name": "Webpack",
      "version": "2-3",
      "desc": "Herramienta para facilutar la construcci칩n de proyectos front-end"
    },
    "docker": {
      "name": "Docker",
      "version": "2-3",
      "desc": "Permite desplegar aplicaciones creando conteendores"
    },
    "npm": {
      "name": "Npm",
      "version": "2-3",
      "desc": "Gestor de paquetes para Node.js y Javascript"
    },
    "yarn": {
      "name": "Yarn",
      "version": "2-3",
      "desc": "Gestor de paquetes para Node.js y Javascript. La 칰ltima versi칩n tuvo bastantes problemas debido a su falat de retrocompatibilidad."
    },
    "mongo": {
      "name": "Mongo",
      "version": "2-3",
      "desc": "El m치s famoso gestor de BBDD para NoSQL"
    },
    "mariadb": {
      "name": "MariaDb",
      "version": "2-3",
      "desc": "Gestor de BBDD de tipo SQL deribado de MySQL. Apareci칩 por desaveniencias con Oracle cuando compr칩 Sun"
    },
    "visualcode": {
      "name": "Visual Studio Code",
      "version": "2-3",
      "desc": "IDE considerado standard de facto en el mundo front-end. Permite ampliar funcionalidades mediante plugings"
    },
    "git": {
      "name": "Git",
      "version": "2-3",
      "desc": "El control de versiones m치s famoso"
    }
  },
  "exp": {
    "title": "Experience",
    "text": "I have been a developer for 7 years. I usually made webs in the HTML4 era when I was younger. I wanted to be an illustrator but it wasn't made for me. Decid칤 estudiar ingenier칤a inform침atica y al termianr comence haciendo aplicaciones m칩biles con Android. Al poco comence con el desarrollo web y me especialic칠 en el desarrollo front. Mainly I worked in consulting companies developing for medium-large size companies such as Odigeo, inditex and EUIPO/WIPO."
  },
  "projects": {
    "lionmiss": {
      "title": "Lion Miss",
      "desc": "Tienda online de ejemplo con m칰ltiples funciones: carrito, galeria, comentarios, envio, usuarios..."
    },
    "cheety": {
      "title": "Cheety",
      "desc": ""
    },
    "personalPage": {
      "title": "Mi web personal",
      "desc": ""
    },
    "personalBlog": {
      "title": "Mi blog personal",
      "desc": ""
    },
    "codepen": {
      "title": "Codepen",
      "desc": ""
    },
    "stackblitz": {
      "title": "Stackblitz",
      "desc": ""
    }
  },
  "contact": {
    "name": "name",
    "mail": "example@email.com",
    "msg": "What do ypu want? :)",
    "send": "Send",
    "ok": "춰Mensaje enviado! Recivir치s pronto en tu correo la confirmaci칩n :)",
    "ko": "춰Vaya! Parece que hubo un problema. Int칠ntelo m치s tarde :(",
    "required": "El campo est치 vacio",
    "requiredMsg": "El cuerpo del mensaje est치 vacio",
    "formatMail": "Un email tiene el formato xxx@xxx.xxx",
    "minMsg": "El mensaje a de tener m치s de 50 chars",
    "maxMsg": "El mensaje no puede exceder los 600 chars"
  }
}
